testing/integration/load-tests/basic-load.yml
config:
  target: "{{ $processEnvironment.API_GATEWAY_URL }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Peak load"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.TEST_ADMIN_EMAIL }}"
            password: "{{ $processEnvironment.TEST_ADMIN_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

  - name: "Get Patients List"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.TEST_ADMIN_EMAIL }}"
            password: "{{ $processEnvironment.TEST_ADMIN_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/patients?limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Create Patient"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.TEST_ADMIN_EMAIL }}"
            password: "{{ $processEnvironment.TEST_ADMIN_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/patients"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            firstName: "Load"
            lastName: "Test"
            dateOfBirth: "1990-01-01"
            gender: "male"
            email: "loadtest{{ $randomNumber() }}@test.com"
            phone: "+249{{ $randomNumber(100000000, 999999999) }}"

  - name: "Get Appointments"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.TEST_ADMIN_EMAIL }}"
            password: "{{ $processEnvironment.TEST_ADMIN_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/appointments?limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"